app/controllers/pages_controller.rb

  def index
    if logged_in?
      if Movie.without_user(current_user).count == 0
        @movie = nil
      else
        @movie = Movie.without_user(current_user).offset(rand(Movie.without_user(current_user).count)).limit(1).first
      end
    else
      @movie = Movie.offset(rand(Movie.count)).limit(1).first
    end
    @feed = Rating.latest
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (3, 2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT COUNT(*) FROM "movies" INNER JOIN "ratings" ON "ratings"."movie_id" = "movies"."id" WHERE (ratings.user_id != 1)
SELECT "movies".* FROM "movies" INNER JOIN "ratings" ON "ratings"."movie_id" = "movies"."id" WHERE (ratings.user_id != 1) LIMIT 1 OFFSET 2
SELECT "ratings".* FROM "ratings" WHERE (user_id = 1)

  def destroy
    Movie.find(params[:id]).destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 6]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]

  def login
    user = User.authenticate(params[:login][:username], params[:login][:password])
    if user
      session[:login] = nil
      cookies.permanent.signed[:user_id] = user.id
      redirect_to root_path, notice: "Welcome back."
    elsif User.username_taken?(params[:login][:username])
      session[:login] = nil
      redirect_to root_path, alert: "Wrong password."
    else
      user = User.new(params[:login])
      user.password_confirmation = session[:login][:password] if session[:login] && params[:login][:username] == session[:login][:username]
      if user.save
---
INSERT INTO "users" ("admin", "created_at", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def rate
    if movie = Movie.find_by_id(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1

  def add_movie
    redirect_to(root_path, alert: "The was already in the database.") and return unless Movie.scrape_imdb(params[:imdb_id])
    @movie = Movie.find_by_imdb(params[:imdb_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."imdb" = 'tt0146984' LIMIT 1